Tekla Open API Reference for Tekla Structures 2025
View.DisplayOrientationType Enumeration
 The view plane types. The plane type can be changed.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum DisplayOrientationType
Public Enumeration DisplayOrientationType
Members
Member name | Value | Description
DISPLAY_VIEW_PLANE | 0 |  The display orientation is in the view plane defined by the view coordinate system.
DISPLAY_3D | 1 |  The display orientation is in 3D defined by the display coordinate system.
See Also
Reference
Tekla.Structures.Model.UI Namespace